package ninethexample.classwork.task2;
//Используя модуль enum, создайте перечисление Season, которое содержит сезоны года: SPRING, SUMMER, AUTUMN, WINTER.
//Напишите функцию, которая принимает значение из перечисления и возвращает тип погоды:
//Если WINTER — возвращает "Холодно".
//Если SUMMER — "Жарко".
//Если SPRING или AUTUMN — "Прохладно".
//Добавьте проверку корректности: если передано значение не из перечисления, выведите "Неизвестный сезон".
public enum Season {
    SPRING,
    SUMMER,
    AUTUMN,
    WINTER;
}


